# Guided Project: Analyzing CIA Factbook Data Using SQL

In this project, we'll work with data from the CIA World Factbook, a compendium of statistics about all of the countries on Earth. The Factbook contains demographic information like the following:

- population — the global population.
- population_growth — the annual population growth rate, as a percentage.
- area — the total land and water area.

In [1]:
%%capture
%load_ext sql
%sql sqlite:///factbook.db

'Connected: None@factbook.db'

In [2]:
%%sql
SELECT *
    FROM sqlite_master
WHERE type = 'table';

Done.

[('table', 'sqlite_sequence', 'sqlite_sequence', 3, 'CREATE TABLE sqlite_sequence(name,seq)'),
 ('table', 'facts', 'facts', 47, 'CREATE TABLE "facts" ("id" INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL, "code" varchar(255) NOT NULL, "name" varchar(255) NOT NULL, "area" integer, "a ... (4 characters truncated) ... land" integer, "area_water" integer, "population" integer, "population_growth" float, "birth_rate" float, "death_rate" float, "migration_rate" float)')]

In [3]:
%%sql
SELECT * FROM facts LIMIT 5;

Done.

[(1, 'af', 'Afghanistan', 652230, 652230, 0, 32564342, 2.32, 38.57, 13.89, 1.51),
 (2, 'al', 'Albania', 28748, 27398, 1350, 3029278, 0.3, 12.92, 6.58, 3.3),
 (3, 'ag', 'Algeria', 2381741, 2381741, 0, 39542166, 1.84, 23.67, 4.31, 0.92),
 (4, 'an', 'Andorra', 468, 468, 0, 85580, 0.12, 8.13, 6.96, 0.0),
 (5, 'ao', 'Angola', 1246700, 1246700, 0, 19625353, 2.78, 38.78, 11.49, 0.46)]

In [4]:
%%sql
SELECT MIN(population), MAX(population), MIN(population_growth), MAX(population_growth)
FROM facts;

Done.

[(0, 7256490011, 0.0, 4.02)]

In [5]:
%%sql
SELECT name, population 
FROM facts 
WHERE population = (SELECT MAX(population) FROM facts);

Done.

[('World', 7256490011)]

In [6]:
%%sql
SELECT name, population 
FROM facts 
WHERE population = (SELECT MIN(population) FROM facts);

Done.

[('Antarctica', 0)]

It seems like the table contains a row for the whole world, which explains the population of over 7.2 billion. It also seems like the table contains a row for Antarctica, which explains the population of 0. This seems to match the CIA Factbook page for Antarctica  
Recompute the summary statistics you found earlier while excluding the row for the whole world. Include the following:
- Minimum population
- Maximum population
- Minimum population growth
- Maximum population growth

In [7]:
%%sql
SELECT MIN(population), MAX(population), MIN(population_growth), MAX(population_growth)
FROM facts WHERE name NOT IN ('World', 'Antarctica');

Done.

[(48, 1367485388, 0.0, 4.02)]

Calculate the average value for the following columns:
- population
- area

In [8]:
%%sql
SELECT AVG(population), AVG(area) FROM facts WHERE name NOT IN ('World', 'Antarctica');

Done.

[(32377011.0125, 555093.546184739)]

Write a query that finds all countries meeting both of the following criteria:
- The population is above average.
- The area is below average.

In [9]:
%%sql
SELECT name, population, area
    FROM facts
    WHERE population > (SELECT AVG(population)  FROM facts WHERE name NOT IN ('World', 'Antarctica'))
    AND area > (SELECT AVG(area)  FROM facts WHERE name NOT IN ('World', 'Antarctica'));

Done.

[('Afghanistan', 32564342, 652230),
 ('Algeria', 39542166, 2381741),
 ('Argentina', 43431886, 2780400),
 ('Brazil', 204259812, 8515770),
 ('Burma', 56320206, 676578),
 ('Canada', 35099836, 9984670),
 ('China', 1367485388, 9596960),
 ('Colombia', 46736728, 1138910),
 ('Congo, Democratic Republic of the', 79375136, 2344858),
 ('Egypt', 88487396, 1001450),
 ('Ethiopia', 99465819, 1104300),
 ('France', 66553766, 643801),
 ('India', 1251695584, 3287263),
 ('Indonesia', 255993674, 1904569),
 ('Iran', 81824270, 1648195),
 ('Kenya', 45925301, 580367),
 ('Mexico', 121736809, 1964375),
 ('Nigeria', 181562056, 923768),
 ('Pakistan', 199085847, 796095),
 ('Russia', 142423773, 17098242),
 ('South Africa', 53675563, 1219090),
 ('Sudan', 36108853, 1861484),
 ('Tanzania', 51045882, 947300),
 ('Turkey', 79414269, 783562),
 ('Ukraine', 44429471, 603550),
 ('United States', 321368864, 9826675),
 ('European Union', 513949445, 4324782)]

That's it for the guided steps. Here are some next steps to explore on your own:
- Which country has the most people? Which country has the highest growth rate?
- Which countries have the highest ratios of water to land? Which countries have more water than land?
- Which countries will add the most people to their populations next year?
- Which countries have a higher death rate than birth rate?
- Which countries have the highest population/area ratio, and how does it compare to list we found in the previous screen?